# 02: Pemilihan baris (rows selection) pada Data Frame

2273001 - Olivia Justine Audia

Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.4.4
1.21.5

Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  4  4  3  2  2
1  3  1  3  3  3
2  1  1  2  4  4
3  2  3  3  3  4
4  3  1  3  1  4
5  4  4  2  4  3
6  1  3  4  1  1
7  3  3  2  2  4
8  4  1  3  3  4
9  4  1  2  1  3

Selection dengan operator logika |

In [4]:
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  3  1  3  3  3
2  1  1  2  4  4
4  3  1  3  1  4
6  1  3  4  1  1
7  3  3  2  2  4

Selection dengan fungsi isin()

In [5]:
df[df['A'].isin([1, 3])]

   A  B  C  D  E
1  3  1  3  3  3
2  1  1  2  4  4
4  3  1  3  1  4
6  1  3  4  1  1
7  3  3  2  2  4

Mengenal operator negasi ~

In [6]:
df[~df['A'].isin([1, 3])]

   A  B  C  D  E
0  4  4  3  2  2
3  2  3  3  3  4
5  4  4  2  4  3
8  4  1  3  3  4
9  4  1  2  1  3